БухЭксп/InformationRegisters/CW_ПризнакНаличияОригиналовДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПризнакНаличияОригиналовДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОригиналыПредоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПризнакНаличияОригиналовДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ЗаписатьНаличеОригиналов(СтруктураПараметров) Экспорт
	
	//Признак наличия оригиналов документо
	НаборНаличияОригиналов = РегистрыСведений.CW_ПризнакНаличияОригиналовДокументов.СоздатьНаборЗаписей();
	НаборНаличияОригиналов.Отбор.ДокументСсылка.Установить(СтруктураПараметров.Ссылка);
	НаборНаличияОригиналов.Очистить();
	
	Запись = НаборНаличияОригиналов.Добавить();
	Запись.ДокументСсылка 			= СтруктураПараметров.Ссылка;
	Запись.ОригиналыПредоставлены 	= СтруктураПараметров.Признак;
	Запись.ДатаПолучения 			= СтруктураПараметров.ДатаВозврата;
	НаборНаличияОригиналов.Записать(Истина);
	
	Если ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") 
		Или ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		ЗаписатьСтатусВедомыхДокументов(СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСтатусВедомыхДокументов(СтруктураПараметров)
	//Запись статусов документов
	НовыйСтатус 		= Неопределено;
	МассивДокументов 	= Новый Массив;
	МассивСчетФактур 	= Новый Массив;
	
	Если ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		Если СтруктураПараметров.Признак Тогда
			НовыйСтатус = Перечисления.СтатусыДокументовРеализации.Подписан;
		Иначе
			НовыйСтатус = Перечисления.СтатусыДокументовРеализации.НеПодписан;
		КонецЕсли; 
		МассивДокументов.Добавить(СтруктураПараметров.ВедомыйДокумент);	
		
	ИначеЕсли ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда 
		
		Если СтруктураПараметров.Признак Тогда
			НовыйСтатус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
			
			Если СтруктураПараметров.Ссылка.ПредъявленСФ Тогда
				СтатусОригиналаСФ = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;	
			КонецЕсли;
			
		Иначе
			НовыйСтатус 		= Перечисления.СтатусыДокументовПоступления.ОригиналНеПолучен;
			СтатусОригиналаСФ 	= Перечисления.СтатусыДокументовПоступления.ОригиналНеПолучен;	
		КонецЕсли;
		МассивДокументов.Добавить(СтруктураПараметров.ВедомыйДокумент);	
		
		Если ЗначениеЗаполнено(СтруктураПараметров.ВедомыйСчетФактура) Тогда
			Если СтруктураПараметров.ВедомыйСчетФактура.Проведен Тогда
				СтатусСФ = Перечисления.СтатусыСчетаФактуры.Проведен;
			Иначе
				СтатусСФ = Перечисления.СтатусыСчетаФактуры.Проведен;
			КонецЕсли;
		
			МассивСчетФактур.Добавить(СтруктураПараметров.ВедомыйСчетФактура);	
		КонецЕсли

		
	КонецЕсли; 
	
	Если МассивДокументов.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
		СтатусыДокумента.Статус 			= НовыйСтатус;
		СтатусыДокумента.СтатусСФ 			= СтатусСФ;
		СтатусыДокумента.СтатусОригиналаСФ 	= СтатусОригиналаСФ;
		
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента);	
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Если МассивСчетФактур.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
		СтатусыДокумента.Статус 			= НовыйСтатус;
		СтатусыДокумента.СтатусСФ 			= СтатусСФ;
		СтатусыДокумента.СтатусОригиналаСФ 	= СтатусОригиналаСФ;
		
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивСчетФактур, СтатусыДокумента);	
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
КонецПроцедуры

#КонецЕсли
